21-rails-api/app/controllers/api/v1/dinosaurs_controller.rb

SELECT  "dinosaurs".* FROM "dinosaurs" WHERE "dinosaurs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        @dino = Dinosaur.find(params[:id])