21-rails-api/app/controllers/api/v1/paddocks_controller.rb

    def index
        @paddocks = Paddock.all
---
SELECT "paddocks".* FROM "paddocks"